/* label of button to dismiss sheet without agreeing (Close rather than OK) */
"Close" = "Закрыть";

/* primary label with product name */
"Connecting to %@..." = "Подключение к продукту %@...";

/* primary label */
"Connecting..." = "Подключение...";

/*
 * Primary label displayed when app runs in "about box" mode.
 * Most of the time this is obscured by the sheet displaying the information
 * about the application.
 */
"PrimaryLabelAbout" = "О программе...";

//----- download progress info -----------------------------------------------//

/* No comment provided by engineer. */
"Downloading (%@ out of %@ Bytes)" = "Загрузка (%1$@ из %2$@ Б)";

/* No comment provided by engineer. */
"Downloading (%@ out of %@ KB)" = "Загрузка (%1$@ из %2$@ КБ)";

/* No comment provided by engineer. */
"Downloading (%@ out of %@ MB)" = "Загрузка (%1$@ из %2$@ МБ)";

//----- product display names ------------------------------------------------//

/** Name displayed in lieu of product when product is not known */
"UnknownTheProduct" = "приложение";

/* G2M product display name */
"GoToMeeting" = "GoToMeeting";

/* G2T product display name */
"GoToTraining" = "GoToTraining";

/* G2W product display name */
"GoToWebinar" = "GoToWebinar";

/* G2A product display name */
"GoToAssist" = "GoToAssist";

/* G2AC product display name */
"GoToAssist Corporate" = "GoToAssist Corporate";

/* GoToMyPC product display name */
"GoToMyPC" = "GoToMyPC";

/* ShareConnect product display name */
"ShareConnect" = "ShareConnect";

//----- About Box ------------------------------------------------------------//


/* Message (title) displayed on face of about box sheet. */
"AboutBoxMessage" = "О программе GoTo Opener";

/* Detailed info displayed on face of about box sheet. */
"AboutBoxInfo" = "Средство GoTo Opener помогает веб-сайтам и программному обеспечению GoTo успешно работать на вашем компьютере.\n\nВерсия: %1\n\nРасположение: %2";


//----- task labels for main window ------------------------------------------//

/* generic launch progress label */
"Initializing" = "Инициализация";

/*
 * Progress label displayed while just-launched, persistently-installed app
 * initially downloads session parameters from Launcher Service
 */
"DownloadingArgs" = "Запрос данных по запуску";

/* progress label displayed while waiting for another DownloaderApp to finish */
"WaitingForMutex" = "Ожидание завершения работы другого средства GoTo Opener";

/* progress label displayed while DownloaderApp installs itself to persistent location */
"InstallingDlApp" = "Установка средства запуска приложений GoTo Opener";

/* generic starting plugin download progress label */
"Starting Plugin Download" = "Начало загрузки модуля";

/* generic installing plugin label */
"Installing Plugin" = "Установка модуля";

/* generic starting download progress label */
"Starting Download" = "Начало загрузки";

/* generic downloading progress label */
"Downloading" = "Загрузка";

/* generic verify archive progress label */
"Verifying" = "Проверка";

/* generic unarchiving progress label */
"Unzipping" = "Распаковка";

/* generic launch progress label */
"Installing" = "Установка";

/* generic launch progress label */
"Launching" = "Запуск";

/* launch installer progress label */
"Launching Installer" = "Запуск установщика";

//----- Message text for error alert sheets ----------------------------------//

/* download failed alert message */
"Download Failed" = "Сбой загрузки";

/* unarchive failed alert message */
"Unarchive Failed" = "Сбой распаковки";

/* installation failed alert message */
"Installation Failed" = "Сбой установки";

/* launch failed alert message */
"Launch Failed" = "Сбой запуска";

//----- Info text for error alert sheets -------------------------------------//

/* boilerplate introduction for error sheets indicating complete failure of the Launcher to launch app, into which specific product name is inserted */
"AppFatalMsgPre"  = "GoTo Opener не удалось запустить %@.";

/* boilerplate introduction for error sheets indicating complete failure of the Launcher to install package, into which specific product name is inserted */
"InstallFatalMsgPre"  = "GoTo Opener не удалось установить %@.";

/* boilerplate conclusion for error sheets indicating complete failure of the Launcher */
"GenericFatalMsgPost" = "Повторите попытку загрузки или обратитесь в глобальную службу поддержки по адресу\nhttp://link.logmeininc.com/get-help.";

/* boilerplate introduction for error sheets indicating failure of the Launcher to download component due to SSL certificate validation errors. */
"SslCertFatalMsgPre"  = "Данный сервер загрузки является ненадежным для GoTo Opener.";

/* boilerplate conclusion for error sheets indicating failure of the Launcher to download component due to SSL certificate validation errors. */
"SslCertFatalMsgPost" = "Убедитесь, что доверенные сертификаты в цепочке ключей обновлены, или обратитесь в глобальную службу поддержки по адресу http://link.logmeininc.com/get-help.";

/* notify user that product endpoint version doesn't support OS version */
"ProductSupportForOsErrorInfo" = "Запрашиваемая версия %@ не поддерживает данную версию Mac OS X.";

/* app download failed alert informative text */
"DownloadAppFailedErrorInfo" = "Не удалось загрузить требуемое приложение с серверов.";

/* app download failed alert instructions to manually download and install endpoint */
"DownloadAppFailedOfferManualDownload" = "Запуск %@ не выполнен, поскольку была проблема с загрузкой приложения. Вместо этого сохраните файл с помощью веб-браузера.\n\n1. Нажмите на кнопку \"Загрузить в браузере\".\n2. Откройте и установите загруженный файл.\n3. Попробуйте присоединиться к сеансу еще раз.";

/* app download failed alert instructions to manually download and install endpoint, post part */
"DownloadAppFailedOfferManualDownloadPost" = "Для получения дополнительной справки обратитесь к системному администратору или в службу поддержки %@ по адресу\nhttps://link.logmeininc.com/get-help.";


/* app download failed alert download button */
"Download" = "Загрузить в браузере";

/* installer download failed alert informative text */
"DownloadInstallerFailedErrorInfo" = "Не удалось загрузить установщик с серверов.";

/* app unarchive failed alert informative text */
"UnarchiveAppFailedErrorInfo" = "Не удалось распаковать требуемое приложение.";

/* installer unarchive failed alert informative text */
"UnarchiveInstallerFailedErrorInfo" = "Не удалось распаковать установщик.";

/* failed to place app bundle in permanent location, alert informative text */
"InstallAppFailedErrorInfo" = "Не удалось установить требуемое приложение.";

/* app launch failed alert informative text */
"LaunchAppFailedErrorInfo" = "Не удалось запустить требуемое приложение.";

/* installer launch failed alert informative text */
"LaunchInstallerFailedErrorInfo" = "Не удалось запустить установщик.";

/* app arguments download failed alert informative text */
"DownloadAppArgumentsFailedErrorInfo" = "Не удалось загрузить необходимые аргументы приложения с серверов.";


//----- for SSL error alert sheets -------------------------------------------//

/* label of button to retry on authentication timeout (not abort the app) */
"AuthTimeoutErrorRetryButtonLabel" = "Повторить";

/* label of button to cancel retry on authentication timeout (so abort the app) */
"AuthTimeoutErrorCancelButtonLabel" = "Закрыть";

/* authentication timeout alert message */
"AuthTimeoutErrorMsg" = "Превышено время проверки подлинности";

/* authentication timeout alert informative text */
"AuthTimeoutErrorInfo" = "Не удалось проверить подлинность учетных данных за отведенное время. Возможно, вы ввели неправильное имя или пароль. Повторите попытку.";

/* label of button to retry on connection lost during authentication (not abort the app) */
"AuthDisconnectErrorRetryButtonLabel" = "Повторить";

/* label of button to cancel retry on connection lost during authentication (so abort the app) */
"AuthDisconnectErrorCancelButtonLabel" = "Закрыть";

/* disconnect during authentication alert message */
"AuthDisconnectErrorMsg" = "Сбой проверки подлинности";

/* disconnect during authentication alert informative text */
"AuthDisconnectErrorInfo" = "При проверке подлинности подключение к Интернету было неожиданно прервано. Возможно, вы ввели неправильное имя или пароль. Повторите попытку.";

/* SSL server certificate error alert message */
"ServerSslCertErrorMsg" = "Ненадежное удостоверение сервера";

/* generic SSL server certificate error informative text */
"ServerSslCertError" = "Сертификат сервера недействителен. Подключение к серверу может представлять опасность для конфиденциальной информации.";

/* generic SSL server certificate error informative text <URL including host> */
"ServerSslCertErrorWithUrl" = "Сертификат сервера на %@ недействителен. Подключение к серверу может представлять опасность для конфиденциальной информации.";

/* generic SSL server certificate error informative text <host name> */
"ServerSslCertErrorWithHostName" = "Сертификат сервера %@ недействителен. Подключение к серверу может представлять опасность для конфиденциальной информации.";

/* label of button to close server certificate error dialog and abort the app */
"ServerCertErrorCancelButtonLabel" = "Закрыть";
